{"_id"{"$oid":"5d36deb51c9d44000015d250"},"category_name":"Meat","recipe_name":"Beef and Vegetable Casserole","author_name":"Sarah Cook","prep_time_mins":"15","cook_time_mins":"180","complexity":"Easy","favourite":"False","servings":"5","brief_description":"A traditional braised beef stew with thick, rich gravy – an ideal recipe for cheap cuts as slow-cooking guarantees a tender dish","calories":"483","ingredients":["2 celery sticks,thickly sliced 1 onion,chopped 2 really big carrots,halved lengthways then very chunkily sliced 5 bay leaves 2 thyme sprigs, 1 whole and 1 leaves picked, 1 tbsp vegetable oil, 1 tbsp butter, 2 tbsp plain flour, 2 tbsp tomato purée, 2 tbsp Worcestershire sauce, 2 beef stock cubes, crumbled 850g stewing beef (featherblade or brisket works nicely), cut into nice large chunks"],"instructions":["Heat oven to 160C/140C fan/gas 3 and put the kettle on. Put 2 thickly sliced celery sticks, 1 chopped onion, 2 chunkily sliced carrots, 5 bay leaves and 1 whole thyme sprig in a flameproof casserole dish with 1 tbsp vegetable oil and 1 tbsp butter. Soften for 10 mins, then stir in 2 tbsp plain flour until it doesn’t look dusty anymore, followed by 2 tbsp tomato purée, 2 tbsp Worcestershire sauce and 2 crumbled beef stock cubes. Gradually stir in 600ml hot water, then tip in 850g stewing beef and bring to a gentle simmer. Cover and put in the oven for 2hrs 30 mins, then uncover and cook for 30mins – 1hr more until the meat is really tender and the sauce is thickened. Garnish with the picked leaves of the remaining thyme sprig."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--890477_11.jpg?itok=aYnDFCNC" }
{"_id"{"$oid":"5d38355c1c9d440000dcb670"},"category_name":"Meat","recipe_name":"Spaghetti Bolognese","author_name":"Andrew Balmer","prep_time_mins":"25","cook_time_mins":"110","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Best ever Spaghetti Bolognese is super easy and a true Italian classic with a meaty, chilli sauce.","calories":"624","ingredients":["1 tbsp olive oil, 4 rashers smoked streaky bacon, finely chopped 2 medium onions, finely chopped 2 carrots, trimmed and finely chopped 2 celery sticks, finely chopped 2 garlic cloves, finely chopped 2-3 sprigs rosemary, 500g beef mince, 2 x 400g tins plum tomatoes, small pack basil, 1 tsp dried oregano, 2 fresh bay leaves, 2 tbsp tomato purée, 1 beef stock cube, 1 red chilli, 125ml red wine 6 cherry tomatoes, 75g grated parmesan cheese, 400g spaghetti"],"instructions":["Put a large saucepan on a medium heat and add 1 tbsp olive oil.  Add 4 finely chopped bacon rashers and fry for 10 mins until golden and crisp. Reduce the heat and add the 2 onions, 2 carrots, 2 celery sticks, 2 garlic cloves and the leaves from 2-3 sprigs rosemary, all finely chopped, then fry for 10 mins. Stir the veg often until it softens. Increase the heat to medium-high, add 500g beef mince and cook stirring for 3-4 mins until the meat is browned all over. Add 2 tins plum tomatoes, the finely chopped leaves from ¾ small pack basil, 1 tsp dried oregano, 2 bay leaves, 2 tbsp tomato purée, 1 beef stock cube, 1 deseeded and finely chopped red chilli (if using), 125ml red wine and 6 halved cherry tomatoes. Stir with a wooden spoon, breaking up the plum tomatoes. Bring to the boil, reduce to a gentle simmer and cover with a lid. Cook for 1 hr 15 mins stirring occasionally, until you have a rich, thick sauce. Add the 75g grated parmesan, check the seasoning and stir. When the Bolognese is nearly finished, cook 400g spaghetti following the pack instructions. Drain the spaghetti and stir into the Bolognese sauce. Serve with more grated parmesan, the remaining basil leaves."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/the-best-spaghetti-bolognese.jpg?itok=PH6AqY-g" }
{"_id"{"$oid":"5d383a881c9d440000dcb671"},"category_name":"Meat","recipe_name":"Beef Wellington","author_name":"Gordon Ramsay","prep_time_mins":"25", "cook_time_mins":"150","complexity":"Challenge","favourite":"False","servings":"6","brief_description":"Gordon Ramsay's version of the classic steak dish - a show-stopping centrepiece on a special occasion.", "calories" : "763", "ingredients":["A good beef fillet (preferably Aberdeen Angus) of around 1kg/2lb 4oz, 3 tbsp olive oil,  250g/9oz chestnut mushroom, 50g/2oz butter, 1 large sprig fresh thyme, 100ml/3½ fl oz dry white wine, 12 slices prosciutto, 500g/1lb 2oz pack puff pastry, flour for dusting, 2 egg yolks beaten with 1 tsp water"],"instructions":["Heat oven to 220C/fan 200C/gas 7. Sit the 1kg beef fillet on a roasting tray, brush with 1 tbsp olive oil and season with pepper, then roast for 15 mins for medium-rare or 20 mins for medium. When the beef is cooked to your liking, remove from the oven to cool, then chill in the fridge for about 20 mins. While the beef is cooling, chop 250g chestnut (and wild, if you like) mushrooms as finely as possible so they have the texture of coarse breadcrumbs. You can use a food processor to do this, but make sure you pulse-chop the mushrooms so they don’t become a slurry. Heat 2 tbsp of the olive oil and 50g butter in a large pan and fry the mushrooms on a medium heat, with 1 large sprig fresh thyme, for about 10 mins stirring often, until you have a softened mixture. Season the mushroom mixture, pour over 100ml dry white wine and cook for about 10 mins until all the wine has been absorbed. The mixture should hold its shape when stirred. Remove the mushroom duxelle from the pan to cool and discard the thyme. Overlap two pieces of cling film over a large chopping board. Lay 12 slices prosciutto on the cling film, slightly overlapping, in a double row. Spread half the duxelles over the prosciutto, then sit the fillet on it and spread the remaining duxelles over. Use the cling film’s edges to draw the prosciutto around the fillet, then roll it into a sausage shape, twisting the ends of cling film to tighten it as you go. Chill the fillet while you roll out the pastry. Dust your work surface with a little flour. Roll out a third of the 500g pack of puff pastry to a 18 x 30cm strip and place on a non-stick baking sheet. Roll out the remainder of the 500g pack of puff pastry to about 28 x 36cm. Unravel the fillet from the cling film and sit it in the centre of the smaller strip of pastry. Beat the 2 egg yolks with 1 tsp water and brush the pastry’s edges, and the top and sides of the wrapped fillet. Using a rolling pin, carefully lift and drape the larger piece of pastry over the fillet, pressing well into the sides. Trim the joins to about a 4cm rim. Seal the rim with the edge of a fork or spoon handle. Glaze all over with more egg yolk and, using the back of a knife, mark the beef Wellington with long diagonal lines taking care not to cut into the pastry. Chill for at least 30 mins and up to 24 hrs. Heat oven to 200C/fan 180C/gas 6. Brush the Wellington with a little more egg yolk and cook until golden and crisp – 20-25 mins for medium-rare beef, 30 mins for medium. Allow to stand for 10 mins before serving in thick slices."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1079534_10.jpg?itok=SajjID9_" }
{"_id"{"$oid":"5d383dd51c9d440000dcb672"},"category_name":"Meat","recipe_name":"Pork with Pears","author_name":"BBC Good Food","prep_time_mins":"5","cook_time_mins":"10","complexity":"Easy","favourite":"False","servings":"4","brief_description":"A simple yet stunning recipe that combines well known flavours to create an exquisite dish.","calories":"334","ingredients":["1 tbsp sunflower oil, 2 red onions, 2 large pears, few sprigs rosemary, 4 175g/6oz pork steaks, 50g blue cheese."],"instructions":["Heat the oil in a roasting tin on the hob (use 2 rings), then add the onions, pears, most of the rosemary and seasoning. Fry for 5 mins or until just starting to caramelise. Heat grill to high. Season the pork, then arrange among the veg and fry for 5 mins, turning halfway until golden and cooked through. Scatter with the remaining rosemary and the cheese, grill until the cheese starts to melt, then serve."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--560932_11.jpg?itok=evb0kvbH" }
{"_id"{"$oid":"5d3840141c9d440000dcb673"},"category_name":"Meat","recipe_name":"Shanghai style braised pork","author_name":"Ken Hom","prep_time_mins":"30","cook_time_mins":"210","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Share this pork dish with your friends for Chinese New Year.","calories":"546","ingredients":["1 2Kg pork blade bone with rind, 1 small orange, 2 whole star anise, 2 cinnamon sticks, 1 tbsp cumin seeds, 3 dried red chillies, 8 bok choi or Chinese leaves, plain boiled rice, 600ml/1 pint Shaoxing rice wine or dry sherry, 1.2 litres/2 pints homemade chicken stock, 300ml pint dark soy sauce, 50ml light soy sauce, 175g Chinese rock sugar or granulated sugar, 8 slices fresh root ginger, 6 garlic cloves, 6 whole spring onions, 1 tbsp salt, 1 tsp freshly ground black peppercorn."], "instructions":["Bring a large pan of water to the boil, add the pork. Return to the boil, skim, reduce the heat and simmer gently, partially covered, for 30 minutes. Drain thoroughly. Using a potato peeler, remove 8 strips of zest from the orange. Put the star anise, cinnamon sticks, cumin seeds, dried chillies and orange zest in a piece of muslin and tie together tightly. Make the braising liquid by combining all the ingredients in a very large pot and bringing the liquid to a simmer. Add the bag of spices and the blanched pork, and bring back to a simmer, partially covered, skimming all the while. Cover the pot tightly and continue to simmer gently for 3 hours, until the pork fat and rind are very soft and tender. You can do this up to a day ahead, let the pork cool in the liquid, chill overnight, then reheat gently in the liquid before serving. Cut the bok choi in halves or quarters depending on their size, or the Chinese leaves into 5cm/2in pieces. When the pork is done, remove it from the liquid. Remove the skin and cut the meat into small pieces. Add the bok choi to the pot and cook over high heat until it is very tender about 3 minutes. Remove the bok choi from the cooking liquid and place on a warm dish. Arrange the pork on top. Skim off all the fat from the braising liquid and boil it to reduce it by about half. Pour some over the meat to moisten it and serve the rest separately. (You will probably have a lot leftover.) Serve with rice."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--788_11.jpg?itok=q_eEkKJ5" }
{"_id"{"$oid":"5d4090281c9d440000e16303"},"category_name":"Meat","recipe_name":"Slow Cooker Pork Fillet with Apples","author_name":"BBC Good Food","prep_time_mins":"15","cook_time_mins":"240","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Pork and apples is a classic combination and the meat is all the more tender when slow-cooked for four hours. Serve with greens for a complete, healthy meal.","calories":"344","ingredients":["½ tbsp rapeseed oil, 500g pork fillet, 1 medium onion, 3 eating apples, 150ml low-salt chicken stock, 1 tbsp Dijon mustard, 4 sage leaves, 2 tbsp half-fat crème fraîche"],"instructions":["Heat the slow cooker. Heat the oil in a large frying pan, fry the pork medallions on each side for 2 mins until they pick up a little colour. Fry the onion for a few mins, then add the stock and mustard to the pan and stir. Tip the pork and sauce into the slow cooker. Core and cut the apples into quarters, add them to the pot with the sage. Season with black pepper. Cook on Low for 4 hours or until the meat is tender, then stir in the crème fraîche."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/09/porkwapples.jpg?itok=qEYXKDGE" }
{"_id"{"$oid":"5d3853821c9d440000dcb674"},"category_name":"Poultry","recipe_name":"Thai sticky chicken & ribs","author_name":"Lulu Grimes","prep_time_mins":"30","cook_time_mins":"90","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Marinate this Thai street food favourite the night before for maximum flavour.","calories":"533","ingredients":["3 small green chillies, 3 garlic cloves, chopped 3cm/1¼ inch piece ginger, chopped 1 tsp ground turmeric, 2 tbsp soy sauce, 4 tbsp fish sauce, 8 tbsp palm or soft brown sugar, 2 tbsp clear honey, 4 chicken thighs, 2 slabs pork loin ribs, 1kg/2lb 4oz steamed rice, 200g caster sugar, 1 garlic clove, 3 tbsp white vinegar (rice or wine), juice 1 lime, 1 tbsp fish sauce, 1 red bird's-eye chilli, finely sliced handful coriander leaves."],"instructions":["To make the marinade, put the chillies, coriander stalks, garlic, ginger, turmeric, soy sauce, fish sauce, sugar and honey in a food processor. Whizz to a rough paste. Cut each chicken thigh into 2 pieces down the side of bone (so one side keeps the bone). Put all the chicken and ribs in a ceramic dish or suitable plastic container and pour over the marinade. Turn the meat over so it is coated, cover and put it in the fridge until needed (up to 24 hrs). Make the sauce. Put the sugar in a pan with 250ml water, bring to the boil, simmer for a few mins to make a sugar syrup, then stir in garlic, vinegar, lime juice, fish sauce and chilli. Cool, then stir in coriander. Will keep for 24 hrs in the fridge. Heat oven to 160C/140C fan/gas 3. Lift the ribs into a baking dish, cover with foil and put in the oven for 1 hr. Add the chicken pieces around the ribs, turn up the oven to 200C/180C fan/gas 6 and cook, uncovered, for 20 mins or so until the chicken is cooked through. By now the surface of the ribs and chicken should be quite brown and the marinade slightly sticky; if it isn’t, put the lot under the grill – but keep an eye on it. Cut the ribs into sections and pile onto a platter with the chicken, drizzle over some sauce and serve the rest alongside with the salad and some steamed rice."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--659470_11.jpg?itok=81XCs3dn" }
{"_id"{"$oid":"5d3855f21c9d440000dcb675"},"category_name":"Poultry","recipe_name":"Spatchcock Piri Piri Chicken","author_name":"James Martin","prep_time_mins":"15","cook_time_mins":"35","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Butterfly a whole chicken by removing the backbone to keep it juicy during grilling, and flavour with a chilli pepper marinade.","calories":"552","ingredients":["1 chicken (about 1½ kg/3lb 5oz), 4 red chillies, chopped (deseeded if you don't like it too spicy), 3 garlic cloves, crushed 2 tsp sweet paprika, 2 tbsp red wine vinegar, 2 tbsp chopped parsley, 2 tbsp olive oil, lemon wedges, Tabasco sauce (optional)."],"instructions":["To spatchcock the chicken, flip it over so the backbone is facing you. Using a sturdy pair of kitchen scissors or poultry scissors, cut down either side of the backbone, then discard. Turn the chicken over and push down firmly on the breastbone to flatten out the bird. Make a few slashes in each leg joint. You can watch a video showing how to spatchcock a chicken in the How To Cook section of the website). Put the chillies and garlic in a food processor with a good pinch of salt, or use a pestle and mortar. Blend to a paste, then add the paprika, vinegar, parsley and olive oil. Mix well, then smear over the chicken. Leave to marinate for at least 1 hr or overnight if possible. Can be frozen at this stage. Fire up the barbecue. When the flames have died down, place the chicken on the centre of the barbecue, skin-side down, and cook for 15-20 mins until nicely charred. Flip the chicken over and continue cooking for another 5-15 mins until cooked through. Check that the juices run clear, as the heat of every barbecue will vary. To cook in the oven, heat to 200C/180C fan/gas 6 and cook for 35-40 mins on a baking tray. To char the skin, grill for a further 5-10 mins. Serve with lemon wedges, and Tabasco if you like it hot."], "recipe_image" : "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1010505_11.jpg?itok=iAhMHo45" }
{"_id"{"$oid":"5d3857611c9d440000dcb676"},"category_name":"Poultry","recipe_name":"Crispy Duck Pancakes","author_name":"Emma Freud","prep_time_mins":"10","cook_time_mins":"30","complexity":"Easy","favourite":"False","servings":"2","brief_description":"Don't call the Chinese takeaway for crispy duck with pancakes – our recipe is so easy to make and it's healthier, too. Serve with a classic plum sauce.","calories":"402","ingredients":["½ cucumber, bunch spring onions, 1 tbsp honey, 1 tsp Chinese five-spice powder, 2 duck breasts (about 170g each), 5 plums, 50ml agave syrup, 1 tbsp soy sauce, ½ tsp Chinese five-spice powder, 150g plain flour, rapeseed oil."],"instructions":["Heat oven to 180C/160C fan/gas 4. Mix the honey and five-spice in a bowl, then brush all over the duck. Transfer to a roasting tin and roast for 25-30 mins until bronzed. Cool for 10 mins, then shred the meat and finely slice the skin. While the duck is cooking, put all the plum sauce ingredients in a saucepan and simmer gently over a medium heat for 15 mins or until the plums are soft and the sauce is thick. Using a stick blender, blend until smooth. While the sauce is cooking, put the flour, 125ml boiling water and a pinch of salt in a bowl and mix together until it forms a dough. When cool enough to handle, knead for 5-10 mins. Divide it into 10 little balls and roll each one out as thin as you can. Brush a frying pan with the oil and cook each pancake over a medium heat for 20 secs each side or until cooked but not browned. Spread a pancake with a little plum sauce. Top with the shredded duck, a few pieces of cucumber and spring onion."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/09/emma-freud-duck-and-pancakes.jpg?itok=ByA5xIdd" }
{"_id"{"$oid":"5d385a1f1c9d440000dcb677"},"category_name":"Poultry","recipe_name":"Warm Duck Salad with Walnut and Orange Dressing","author_name":"Sara Buenfeld","prep_time_mins":"20","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"The perfect dinner party main for those with a small kitchen and a great meal-in-one.","calories":"742","ingredients":["4 duck breasts, 4 medium potatoes, 16 walnuts, 250g vacuum-packed beetroot (with vinegar), 100g bag watercress, 4 spring onions, 1 head chicory, 3 small oranges, 4 tbsp walnut oil, 4 tsp red wine vinegar, 1 tbsp chunky marmalade."],"instructions":["Mix the dressing ingredients with salt and pepper, then set aside. Heat a large non-stick frying pan, add the duck, skin side down, then fry for 10 mins. (During this time a large amount of fat will come from the skin and it will turn golden, but the flesh shouldn’t cook too much.) Turn the duck breasts over for a second to seal, then take from the pan. Toss the potatoes in the duck fat and fry, turning frequently, until they are golden. Add the walnuts, stir, then lift everything out of the fat with a slotted spoon and put in a roasting tin. Put the duck on a roasting rack on top. Brush the beetroot with a little of the duck fat and put on a separate dish. This can all be done on the morning if you want to get ahead, but chill the duck and bring back to room temperature before cooking. To serve: Heat oven to 220C/fan 200C/gas 7. Roas the duck, potatoes and beetroot for 15 mins, then cut the beetroot into wedges. Put the watercress, spring onions and chicory in a bowl and toss with three-quarters of the dressing. Pile onto plates with the sliced oranges and beetroot, then scatter with the potatoes and walnuts. Slice the duck (you can remove the fat first if you like), arrange on top of the salad and drizzle with the remaining dressing. Serve while still warm."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--5265_12.jpg?itok=-S0IEu_E" }
{"_id"{"$oid":"5d385be01c9d440000dcb678"},"category_name":"Poultry","recipe_name":"Turkey and Mushroom Pot Pies","author_name":"Chelsie Collins","prep_time_mins":"25","cook_time_mins":"40","complexity":"Easy","favourite":"False","servings":"2","brief_description":"It doesn't get much more comforting than the classic British pie - add streaky bacon and thyme and serve in individually portioned dishes.","calories":"882","ingredients":["1 tbsp butter, 1 large onion, 4 rashers streaky bacon, 140g chestnut mushrooms, 250g turkey mince, 25g plain flour, 200ml chicken stock, a few thyme sprigs, 375g sheet ready-rolled puff pastry, 1 egg yolk, wilted spring greens."],"instructions":["Heat the butter in a large pan. Add the onion and cook for 8-10 mins until softened. Add the bacon and mushrooms, and cook until both are browned. Add the turkey mince, breaking up with a wooden spoon, and cook for another 5 mins until browned. Add the flour, stir for 1 min or so, then pour in the chicken stock and add the thyme. Mix well and cook over a medium heat for 1-2 mins until it boils and thickens slightly. Season to taste and set aside to cool for 10-15 mins. Heat oven to 220C/200C fan/gas 7. Once cooled, divide the turkey mixture between 2 ramekins or mini pie dishes. Unroll the pastry and cut out 2 squares to sit on top. Press the edges down the side of the dishes and glaze with the egg yolk. Bake in the oven for 30 mins until golden and cooked through. Serve with wilted spring greens."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/turkey-mushroom-pot-pies.jpg?itok=EVo7Op-j" }
{"_id"{"$oid":"5d4092911c9d440000e16304"},"category_name":"Poultry","recipe_name":"Broccoli Lemon Chicken with Cashews","author_name":"Sara Buenfeld","prep_time_mins":"15","cook_time_mins":"10","complexity":"Easy","favourite":"False","servings":"2","brief_description":"A superhealthy meal for two - full of vitamin C. You could use ordinary broccoli instead of tender stem.","calories":"372","ingredients":["1 tbsp groundnut oil or sunflower oil, 340g chicken breast fillets, 2 garlic cloves, 1 pack stem broccoli, 200ml chicken stock, 1 heaped tsp cornflour, 1 tbsp clear honey, zest of half a lemon, juice of a whole lemon, a large handful of roasted cashews"],"instructions":["Heat the oil in a large frying pan or wok. Add the chicken and fry for 3-4 minutes until golden. Remove from the pan and add the garlic and broccoli. Stir fry for a minute or so then cover and cook for 2 minutes more, until almost tender. Mix the stock, cornflour and honey or sugar well, then pour into the pan and stir until thickened. Tip the chicken back into the pan and let it heat through, then add the lemon zest and juice, and cashew nuts. Stir, then serve straight away with basmati rice or noodles."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--884_9.jpg?itok=Gsvc5q3G" }
{"_id"{"$oid":"5d3860011c9d440000dcb679"},"category_name":"Fish","recipe_name":"Roast Fish with Chickpeas and Ginger","author_name":"John Torode","prep_time_mins":"10","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"An autumnal warmer of a fish dish.","calories":"318","ingredients":["3 tbsp vegetable oil, 3 tsp Thai 7- spice, 100g root ginger, 1 red chilli, 400g can chickpeas, 400g can chopped tomatoes, 4 175g white fish fillets, handful coriander leaves."],"instructions":["Heat oven to 200C/fan 180C/gas 6. Heat the oil in a deep, ovenproof frying pan, tip in the 7-spice and sizzle for a moment. Add the ginger and chilli, give it a stir, then add the chickpeas, stirring to coat them with the spices. Pour in the tomatoes, season to taste and bring to the boil. Season the fish and place on top of the chickpea mix, skin side down. Splash some of the sauce over the fish, then roast for 12 mins, or until the fish flakes when gently pressed. Scatter over the coriander and serve."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4069_11.jpg?itok=n0Q_SUNq" }
{"_id"{"$oid":"5d3862131c9d440000dcb67a"),"category_name":"Fish","recipe_name":"Spicy Singaporean Fish", "author_name":"Emma Lewis","prep_time_mins":"10","cook_time_mins":"10","complexity":"Easy","favourite":"False","servings":"2","brief_description":"For a quick fish supper, try this superhealthy dish.","calories":"213","ingredients":["2 red chillies, 2 shallots, 1 garlic clove, 1 lemongrass, small knob ginger, 2 tsp soy sauce, pinch sugar, 2 tbsp vegetable oil, 2 120g fillets lemon sole, chives, coriander"],"instructions" :["Make a paste by blending together the chillies, shallots, garlic, lemongrass, ginger, soy sauce and sugar in a blender or coffee grinder, or use a pestle and mortar. Heat the oil in a small frying pan and cook the paste for 2 mins until it has darkened slightly and you can really smell the spices. Season with a little salt if you like, then set aside. Heat the grill to medium. Put the fish onto a grill pan, then use the back of a teaspoon to smear the paste all over, making a thin layer covering the whole fish. Pop under the grill and cook for 10 mins until the fish flakes easily. Serve with rice and steamed bok choy. Sprinkle chives and coriander on the fish to serve, if you like."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2321_12.jpg?itok=uox6jPUM" }
{"_id"{"$oid":"5d3863d31c9d440000dcb67b"},"category_name":"Fish","recipe_name":"White Fish with Spicy Beans and Chorizo ","author_name":"BBC Good Food","prep_time_mins":"5","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Mop up the juices of this low-fat supper dish with crusty bread.","calories":"304","ingredients":["1 tbsp olive oil, 1 onion, small rosemary sprig, 25g chorizo, 2 garlic cloves, 700g/1lb 9oz bottle passata, 410g can cannellini beans, 200g/7oz green cabbage, pinch sugar, 4 skinless chunky fillets haddock or cod."],"instructions":["Heat the oil in a large frying pan, then soften the onion for 5 mins. Add the rosemary, chorizo and garlic, then fry for 2 mins more until the chorizo is starting to crisp. Tip in the passata, beans, cabbage and sugar, season, then simmer for 5 mins. Add the fish to the pan, leaving the tops of the fillets peeking out of the sauce, then cover with a lid and leave to cook for 3-5 mins or until the flesh flakes easily. Delicious served with crusty bread."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--513643_11.jpg?itok=Qp5k0vbm" }
{"_id"{"$oid":"5d3865ad1c9d440000dcb67c"},"category_name":"Fish","recipe_name":"Tomato and Thyme Cod","author_name":"BBC Good Food","prep_time_mins":"5","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Ready in 20 minutes and low fat, this fish dish is great for a Monday night when you'd rather be on the sofa than in the kitchen.","calories":"172","ingredients":["1 tbsp olive oil, 1 onion, 400g can chopped tomatoes, 1 heaped tsp light soft brown sugar, few sprigs thyme, 1 tbsp soy sauce, 4 cod fillets"],"instructions":["Heat 1 tbsp olive oil in a frying pan, add 1 chopped onion, then fry for 5-8 mins until lightly browned. Stir in a 400g can chopped tomatoes, 1 heaped tsp light soft brown sugar, the leaves from a few sprigs of thyme and 1 tbsp soy sauce, then bring to the boil. Simmer 5 mins, then slip 4 cod fillets into the sauce. Cover and gently cook for 8-10 mins until the cod flakes easily. Serve with baked or steamed potatoes."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--192662_12.jpg?itok=hgOLX3c5" }
{"_id"{"$oid":"5d3869911c9d440000dcb67d"},"category_name":"Fish","recipe_name":"Scallops with Mushrooms and White Wine","author_name":"Anne Willan","prep_time_mins":"210","cook_time_mins":"45","complexity":"Challenge","favourite":"False","servings":"8" "brief_description":"Timeless seafood classic makes for an impressive and elegant main course.","calories":"527","ingredients":["900g shelled scallops, 350ml fish stock, ½ bottle (375ml) white wine, 350g button mushrooms, juice of ½ lemon, 2 tbsp toasted breadcrumbs, 1 tbsp melted butter, 1½ kg floury potatoes, 85g butter, large pinch of grated nutmeg, 6 egg yolks, 2 shallots, 65g butter, 35g plain flour, 125ml crème fraîche or double cream, 8 large scallops shells or shallow individual baking dishes"],"instructions":["For the potatoes, boil them until tender. Drain them, put them back in the pan and dry them for 1-2 minutes over a low heat. Take off the heat and mash the potatoes with the butter, nutmeg, salt and pepper, then beat over a low heat until fluffy. Take the potatoes off the heat and beat in the egg yolks to thicken. Adjust the seasoning. Let the purée cool slightly, then spoon it into a large plastic sandwich bag with a 2cm/3⁄4in cut in a corner (or piping bag with a plain nozzle) and pipe a generous border of potato around each scallop shell. Discard the white muscle from each scallop and cut any large scallops horizontally in half. Heat the fish stock and wine in a pan, add the scallops, cover and poach 1-2 minutes until the scallops just whiten (remember that they will cook further in the sauce). Transfer them to a bowl, reserving the stock separately. Cook the mushrooms, covered, with the lemon juice, salt and pepper, in a thin film of water until tender, about 5-7 minutes. If any liquid remains, simmer uncovered until it has evaporated. Add the mushrooms to the scallops. For the sauce, boil the reserved stock for 10 minutes until reduced to 450ml/16 fl oz. Fry the shallots in the butter until soft, 1-2 minutes. Stir in the flour and cook until it’s foaming. Whisk in the stock and bring to a boil, whisking, then simmer until the sauce thickens to coat a spoon, 3-5 minutes. Add the crème fraîche and any liquid released by the scallops, and simmer until the sauce reaches coating consistency. Season. Heat the oven to 200C/Gas 6/fan 180C. Stir the scallops and mushrooms into the sauce and spoon into the shells. (Can be prepared ahead to this stage and kept in the fridge for 6-8 hours.) Sprinkle with the breadcrumbs and melted butter. Set the shells on a baking sheet, steadying them on a slice of bread or a bed of foil. Bake until browned and bubbling, 12-15 minutes. Serve very hot."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--4830_11.jpg?itok=heKoL9jo" }
{"_id"{"$oid":"5d4094da1c9d440000e16305"},"category_name":"Fish","recipe_name":"Lemon and Black Pepper Crusted Salmon","author_name":"Chelsie Collins","prep_time_mins":"10","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"This simple, speedy fish dish combines contrasting textures of succulent salmon fillets with a crunchy breadcrumb topping.","calories":"346","ingredients":["500g baby new potatoes, zest ½ lemon, 4 tbsp fresh white breadcrumbs, 25g butter, 1½ tsp coarsely ground peppercorns, 4 skinless salmon fillets, a few thyme sprigs, broccoli or spring greens"],"instructions":["Heat oven to 200C/180C fan/gas 6. Wash the potatoes and place in a large pan of cold, salted water. Cover and bring to the boil, then simmer for 15 mins until cooked. While the potatoes cook, combine the lemon zest, breadcrumbs, butter and peppercorns. Put the salmon fillets in a large roasting tin and sprinkle 1 tbsp of crumbs on each fillet. Pop the lemon wedges in the tin and bake for 8-10 mins until the salmon is cooked and the crumb is golden and crunchy. When the potatoes are cooked, drain in a colander and crush lightly. Add a knob of butter, season and scatter with the thyme. Serve with broccoli or spring greens."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/lemon-black-pepper-crusted-salmon.jpg?itok=7icLD0Xy" }
{"_id"{"$oid":"5d386e321c9d440000dcb67e"},"category_name":"Vegetables","recipe_name":"Roasted Vegetables","author_name":"Barney Desmazery","prep_time_mins":"10","cook_time_mins":"40","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Add feta and basil to roasted vegetables for a perfect summer side dish. The trick is to cut all the veg the same size so they cook in the same amount of time.","calories":"198","ingredients":["3 tbsp olive oil, 1 aubergine, 2 mixed coloured peppers, 1 red onion, 2 courgettes, 4 garlic cloves, 3 sprigs of thyme, 200g cherry tomatoes, handful of basil leaves, zest of 1 lemon, 50g feta"],"instructions":["Heat the oven to 200C/180C Fan/gas 6. Mix the oil with the aubergine, peppers, red onion, courgette, garlic and thyme in a bowl with sea salt and black pepper. Tip into a large roasting tin then roast for 30 mins. Add the tomatoes to the pan and return to the oven for 10 mins. Squeeze the garlic from their skins, remove the thyme then scatter over the basil, lemon zest and crumbled feta."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2018/07/roasted-vegetables.jpg?itok=i9mz_Sk9" }
{"_id"{"$oid":"5d386fe61c9d440000dcb67f"},"category_name":"Vegetables","recipe_name":"Summer Vegetable Curry","author_name":"BBC Good Food","prep_time_mins":"10","cook_time_mins":"35","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Give your Friday night curry a healthy makeover with this low-fat, superhealthy, vegetarian dish.","calories":"207","ingredients":["1-2 tbsp red Thai curry paste, 500ml low-sodium vegetable stock, 2 onions, 1 aubergine, 75g red lentil, 200ml can reduced-fat coconut milk, 2 red or yellow peppers, 140g frozen pea, 100g bag baby spinach, brown basmati rice, mango chutney"],"instructions":["Heat the curry paste in a large non-stick saucepan with a splash of the stock. Add the onions and fry for 5 mins until starting to soften. Stir in the aubergine and cook for a further 5 mins – add a little more stock if starting to stick. Add the lentils, coconut milk and the rest of the stock, and simmer for 15 mins or until the lentils are tender. Add the peppers and cook for 5-10 mins more. Stir through the peas and spinach and cook until spinach has just wilted. Serve the curry with rice and mango chutney."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--693558_11.jpg?itok=vR6QEyJx" }
{"_id"{"$oid":"5d38718c1c9d440000dcb680"},"category_name":"Vegetables","recipe_name":"Spiced Vegetable Pilaf","author_name":"BBC Good Food","prep_time_mins":"10","cook_time_mins":"40","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Get four of your five-a-day in one colourful bowl. Vary the veg according to what's in season.","calories":"375","ingredients":["6 carrots, 3 red onions, 2 tbsp olive oil, 2 tsp cumin seeds, 4 cardamom pods, 1 cinnamon stick, 200g brown basmati rice, 400ml vegetable stock, 400g can brown lentils, 200g baby spinach, handful toasted flaked almonds"],"instructions":["Heat oven to 200C/180C fan/gas 6. In boiling water, cook carrots for 4 mins, tipping in onions for the last min of cooking. Drain and mix in a roasting tin with 4 tsp oil, the cumin and seasoning. Roast for 30 mins, while you cook the rice. Heat remaining 2 tsp oil in a large pan. Add cardamom and cinnamon for 30 secs, then add rice and toast for 1 min. Pour over stock and 100ml water, then simmer, covered, for 25-30 mins, until rice is tender and the water absorbed. Remove cinnamon and cardamom. Tip in lentils and fork through before topping with spinach. Put lid back on and cook over a low heat, stirring once, until spinach has wilted and lentils heated through. Fork through again before tipping the cumin roasted veg onto the top and sprinkling with almonds, if using."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--488664_11.jpg?itok=2qbi9fS2" }
{"_id"{"$oid":"5d38731f1c9d440000dcb681"},"category_name":"Vegetables","recipe_name":"Chargrilled Vegetable Salad","author_name":"Barney Desmazery","prep_time_mins":"20","cook_time_mins":"60","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Serve these chargrilled vegetables with torn buffalo mozzarella, for a lovely starter or light supper.","calories":"126","ingredients":["2 red peppers, 3 tbsp olive oil, 1 tbsp red wine vinegar, 1 small garlic clove, 1 red chilli, 1 aubergine, 2 red onions, 6 sundried tomatoes in oil, handful black olives, large handful basil"],"instructions":["First, blacken the peppers all over – do this directly over a flame, over hot coals or under a hot grill. When completely blackened, put them in a bowl, cover with a plate and leave to cool. While the peppers are cooling, mix the oil, vinegar, garlic and chilli in a large bowl. On a hot barbecue or griddle pan, chargrill the aubergine, courgette and onions in batches until they have defined grill marks on both sides and are starting to soften. The time will depend on the intensity of your grill, so use your judgement – courgettes and red onions are fine still slightly crunchy but you want the aubergine cooked all the way through. As the vegetables are ready, put them straight into the dressing to marinate, breaking the onions up into rings. When the peppers are cool enough to handle, peel, remove the stalk and scrape out the seeds. Cut into strips and toss through the veg with any juice from the bowl. Mix in the tomatoes, olives, basil and seasoning. Drizzle with more oil, if you like, and serve either on its own or with mozzarella or crumbled feta."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1042452_11.jpg?itok=5fZjqq8R" }
{"_id"{"$oid":"5d38750b1c9d440000dcb682"},"category_name":"Vegetables","recipe_name":"Spring Vegetable Noodles","author_name":"BBC Good Food","prep_time_mins":"20","cook_time_mins":"5","complexity":"Easy","favourite":"False","servings":"2","brief_description":"A delicious noodle dish done entirely in the wok.","calories":"339","ingredients":["2 tbsp olive oil, 3 smoked back bacon rashers, 250g green vegetables, 2 garlic cloves, 6 spring onions, 150g pack Amoy Straight to Wok new noodle, soy sauce"],"instructions":["Heat the oil in a wok. Using scissors, snip the bacon into the hot oil and fry, stirring occasionally, for 2 minutes. Tip the asparagus and broccoli into the wok with the garlic and spring onions. Stir fry for about a minute then top with the noodles and petits pois and drizzle over a tablespoon of water. Cover the pan and let everything steam for 4 minutes until the broccoli is just tender. Mix everything together and serve straight away, with a bottle of soy sauce on the table so each person can add their own, according to taste."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--514_11.jpg?itok=iAPzbzs0" }
{"_id"{"$oid":"5d4096e61c9d440000e16306"},"category_name":"Vegetables","recipe_name":"Moroccan Mushrooms with Couscous","author_name":"BBC Good Food","prep_time_mins":"15","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"This filling Moroccan meal is packed full of vitamins and vegetables.", "calories":"245","ingredients":["1 red onion, 1 tsp olive oil, ½ tsp ground cinnamon, 1 tsp ground cumin, 300g mushroom, 400g can chopped tomatoes, 410g can chickpeas, 1 tsp clear honey, 175g couscous, 50g soft dried apricots, handful flat-leaf parsley"],"instructions":["Fry the onion in the oil for 6 mins until softened. Add the cinnamon and cumin and cook for 1 min, stirring. Add the mushrooms, cook for 2 mins, then stir in the tomatoes, chickpeas and honey. Season and simmer for 7-8 mins. Meanwhile, mix the couscous with the dried apricots and some seasoning in a bowl. Pour over 250ml boiling water, stir to mix, then cover. Leave to stand for 7 mins or until softened. To serve, fluff up with a fork, stir in the parsley and top with the mushroom mixture. Great served with some green beans."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--265502_12.jpg?itok=fwCzUPrs" }
{"_id"{"$oid":"5d3882881c9d440000dcb683"},"category_name":"Grains","recipe_name":"Pea and Vermouth grain risotto","author_name":"Ruth Watson","prep_time_mins":"15","cook_time_mins":"25","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Try this wheat grain version of 'risotto' as an accompaniment to Ossobucco, instead of risotto Milanese.","calories":"340","ingredients":["2 tbsp Marigold Swiss vegetable bouillon powder, 3 pouches pasta wheat, 85g unsalted butter, 1 shallot, 1 garlic clove, 1 celery stick, 75ml dry white vermouth, 200g frozen pea, 4 tbsp finely grated parmesan, a small handful of fresh parsley"],"instructions":["Bring 1 litre/1¾ pints water and the bouillon powder to the boil in a large saucepan. Add the pouches of wheat grain, tamping them down into the liquid with a wooden spoon. Cover the pan and boil over a medium heat for 18 minutes. Meanwhile, melt 50g/2oz of the butter in a medium-sized frying pan over a low-medium heat. Tip in the shallot, garlic and celery, and gently fry for about 5 minutes, stirring occasionally, until the vegetables have softened a little but haven't coloured. Pour in the vermouth, turn up the heat and bubble until it has almost disappeared. Set the pan aside. Remove the pouches of wheat grain with a pair of tongs and leave them to drain. Tip the peas into the stock remaining in the saucepan and simmer them for 2 minutes or until hot. Drain off the stock, reserving it, and leave the peas in the pan. Cut open the pouches and tip the wheat grain into the peas, then scrape in the contents of the frying pan. Add the parmesan, parsley and the remaining butter, and season with plenty of black pepper – it's unlikely you’ll need more salt. Return the saucepan to a low heat and stir thoroughly until the cheese has melted and the 'risotto' is a loose, creamy mass, adding a spoonful or two of the reserved stock if required. Serve immediately."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2113_11.jpg?itok=X2lYiO2b" }
{"_id"{"$oid":"5d3885361c9d440000dcb684"},"category_name":"Grains","recipe_name":"Mixed Grain and Preserved Lemon Salad","author_name":"Miriam Nice","prep_time_mins":"20","cook_time_mins":"25","complexity":"Easy","favourite":"False","servings":"6","brief_description":"This herby, tangy side dish of quinoa and spelt makes a delicious addition to a dinner party menu.","calories":"294","ingredients":["200g mixed quinoa, 200g pearled spelt, 1 lemon, 2 tbsp pomegranate molasses, 2 tbsp rapeseed oil, 1 tsp mixed spice, 2 preserved lemons, small pack flat-leaf parsley, small pack dill, small pack mint, 1 fennel bulb, 25g pumpkin seeds"],"instructions":["Bring a large pan of water to the boil. Rinse and drain the quinoa and spelt, and add to the pan. Boil for 15-18 mins or until just tender, then rinse and drain again under cold water. Leave to drain in a large sieve. Meanwhile, in a large bowl, whisk together the lemon juice and molasses, then slowly add the oil. Add the mixed spice and season well. Stir the preserved lemons, herbs and fennel into the dressing, then add the grains. Toss to combine, checking the seasoning. Pile the salad onto a large platter, top with the toasted pumpkin seeds and serve."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/mixed-grain-preserved-lemon-salad.jpg?itok=rji8a0fN" }
{"_id"{"$oid":"5d3887381c9d440000dcb685"),"category_name":"Grains","recipe_name":"Pearled Spelt with Tarragon and Red Grapes","author_name":"Miriam Nice","prep_time_mins":"15","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Sweet red grapes add a fruity twist to this satisfying side dish with a tangy mustard and red wine vinegar dressing.","calories":"320","ingredients":["250g pearled spelt, 1 tbsp Dijon mustard, 1 tbsp red wine vinegar, 2 tbsp rapeseed oil, small pack tarragon, 250g red grapes"],"instructions":["Rinse the spelt in a sieve under cold running water, then put in a saucepan and cover with more cold water. Bring to the boil, reduce to a simmer and cook for 15-20 mins. Meanwhile, whisk together the Dijon mustard and vinegar, then continue to whisk as you slowly pour in the oil. Season to taste and add the tarragon. Drain the spelt and rinse it again in cold water. Tip into a dish, pour over the dressing and mix well. Stir in the grapes and serve."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/pearled-spelt-with-tarragon-red-grapes.jpg?itok=zBK5klvt" }
{"_id"{"$oid":"5d3888a51c9d440000dcb686"),"category_name":"Grains","recipe_name":"Herby Quinoa, Feta and Pomegranate Salad","author_name":"Sarah Cook","prep_time_mins":"10","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"A Middle Eastern-style meze bowl with healthy grains, parsley, mint and coriander.","calories":"279","ingredients":["300g quinoa, 1 red onion, 85g raisins or sultana, 100g feta cheese, 200g pomegranate seeds, 85g toasted pine nuts, small pack coriander, flat leaf parsley and mint, 3 lemons, 1 tsp sugar"],"instructions":["Cook the quinoa following pack instructions – it should be tender but with a little bite. Drain well and spread over a platter or wide, shallow bowl to cool quickly and steam dry. When the quinoa is just about cool stir through all of the remaining ingredients with plenty of seasoning."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1201639_11.jpg?itok=gmHdF-pA" }
{"_id"{"$oid":"5d388a651c9d440000dcb687"),"category_name":"Grains","recipe_name":"Couscous with Courgette, Fried Onions and Herbs","author_name":"Sarah Cook","prep_time_mins":"20","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"6","brief_description":"Jazz up this versatile grain with coriander, dill and mint, plus lots of grated greens, storecupboard chickpeas and rocket.","calories":"290","ingredients":["2 onions, 2 tbsp olive oil, 2 courgettes, 300g couscous, 400g can chickpea, 600ml vegetable or chicken stock, 2 lemons, 6 spring onions, small bunch mint, small bunch coriander, small bunch dill, handful rocket"],"instructions":["Gently fry the onions in the oil until softened, then turn up the heat and fry until golden and crisping. Set aside. Mix the courgettes, couscous and chickpeas in a bowl. Pour over the hot stock, cover with cling film and set aside for at least 15 mins. Discard the mint stalks, then roughly chop the leaves with the coriander and dill. Fork through the couscous to break it up, then stir in the lemon juice, fried onions, spring onions, herbs and rocket with some seasoning. Serve at room temperature with the chicken (see 'goes well with')."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1308581_3.jpg?itok=AiF2JPLv" }
{"_id"{"$oid":"5d4099451c9d440000e16307"},"category_name":"Grains","recipe_name":"Bulgur and Quinoa Lunch Bowls","author_name":"Sara Buenfeld","prep_time_mins":"5","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"These meal prep grain bowls use one base and two deliciously different toppings. Choose from avocado, olives and rocket or chickpeas, beetroot and orange.","calories":"369","ingredients":["1 large onion, 150g bulgur and quinoa, 2 sprigs of thyme, 2 tsp vegetable bouillon powder, 1 avocado, 2 tomatoes, 4 tbsp chopped basil, 6 Kalamata olives, 2 tsp extra virgin olive oil, 2 tsp cider vinegar, 2 big handfuls of rocket, 210g can chickpeas, 160g cooked beetroot, 2 tomatoes, 2 tbsp chopped mint, 1 tsp cumin seeds, several pinches of ground cinnamon, 2 tsp extra virgin olive oil, 2 tsp cider vinegar, 1 orange, 2 tbsp toasted pine nuts"],"instructions":["Tip the onion and bulgur mix into a pan, pour over 600ml water and stir in the thyme and bouillon. Cook, covered, over a low heat for 15 mins, then leave to stand for 10 mins. All the liquid should now be absorbed. When cool, remove the thyme and divide the bulgur between four bowls or plastic containers. For the avocado topping, toss all the ingredients together except for the rocket. Pile onto two portions of the bulgur and top with the rocket. For the beetroot topping, first pile the chickpeas on top, then toss the beetroot with the tomato, mint, cumin, a good pinch of cinnamon, the oil and vinegar. Toss well, add the orange, then pile onto the remaining portions of bulghur, scatter with the pine nuts and sprinkle with extra cinnamon. Chill in the fridge until needed."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2018/05/440-400-bulgur-quinoa-lunch-bowls.jpg?itok=1Gn3w99A" }
{"_id"{"$oid":"5d388be01c9d440000dcb688"},"category_name":"Pasta","recipe_name":"Italian Sausage and Chestnut Pasta","author_name":"Jane Hornby","prep_time_mins":"10","cook_time_mins":"30","complexity":"Easy","favourite":"False","servings":"6","brief_description":"A mix of sausagemeat and chestnut chunks creates a rich and nutty pasta sauce, lifting this from an everyday dish to something special.","calories":"576","ingredients":["1 tbsp olive oil, 1 large onion, 450g pack Lincolnshire sausage, 200g vacuum-packed chestnut, 2 garlic cloves, 1 tsp chopped rosemary, 1 tsp fennel seed, 1 glass full-bodied red wine, 500g carton passata, 500g large pasta shells or pappardelle, small pack curly parsley, parmesan or Grana Padano cheese"],"instructions":["Heat the oil in a large frying pan, and fry the onion for 5 mins. Once starting to soften, add the sausagemeat and chestnuts, and fry for another 10-12 mins, breaking the meat up with a wooden spatula or spoon as you fry it. Keep the heat quite high and stir often. When the meat and chestnuts are golden brown, add the garlic, rosemary and fennel seeds, and cook for 2 mins more. Splash in the wine, let most of it boil away, then tip in the passata. Cover and simmer the sauce for 10 mins while you boil the pasta in plenty of salted water, following pack instructions. Reserve a cup of the pasta cooking water, then drain the pasta well. Toss the pasta, 3 tbsp of the water, the ragu and most of the parsley together, then season to taste. Share between bowls, add a grinding of black pepper, the remaining parsley, then a handful of Parmesan shavings."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/sausage-pasta.jpg?itok=FaOxuYOy" }
{"_id"{"$oid":"5d388e6e1c9d440000dcb689"},"category_name":"Pasta","recipe_name":"Garden Vegetable Pasta","author_name":"BBC Good Food","prep_time_mins":"10","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Settle down with a comforting bowl of creamy pasta, safe in the knowledge that it's low-fat too.","calories":"456","ingredients":["350g penne, 140g broccoli, 100g sugar snap pea, 2 courgettes, 1 tbsp olive oil, 100g light cream cheese, 50g grated parmesan, 1 lemon, large handful basil"],"instructions":["Cook the penne according to pack instructions, adding the broccoli florets and sugar snap peas to the pan for the final 3 mins. Meanwhile, gently fry the courgettes in oil for 7-8 mins until soft and tinged pale gold. When the penne and vegetables are almost ready, remove a ladleful of cooking water from the pan. Add 6 tbsp of this to the pan of courgettes, along with the cream cheese, Parmesan, lemon zest, half the lemon juice and seasoning. Stir to make a smooth, creamy sauce. Drain the penne and vegetables, then mix with the creamy sauce, adding the basil, extra lemon juice and seasoning to taste. Serve in warmed bowls."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--1259612_8.jpg?itok=lXfi28RQ" }
{"_id"{"$oid":"5d3890111c9d440000dcb68a"},"category_name":"Pasta","recipe_name":"Greek Pasta Salad","author_name":"BBC Good Food","prep_time_mins":"20","cook_time_mins":"15","complexity":"Easy","favourite":"False","servings":"4","brief_description":"For a fresh idea with pasta, try Greek salad.","calories":"418","ingredients":["300g fusilli pasta spirals, 225g bag prepared fresh baby spinach, 250g punnet cherry tomatoes, 100g black olive, 200g feta cheese, 3 tbsp olive oil"],"instructions":["Tip the fusilli into a large pan of boiling salted water and boil for 10 minutes. Throw in the spinach, stir well and boil for another 2 minutes. Drain into a colander or sieve and leave to drip-dry. Tip the tomatoes, olives and feta into a big bowl, grind lots of black pepper over and then drizzle with the olive oil. Toss in the drained pasta and spinach, and let everyone help themselves."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2681_11.jpg?itok=rc8XFndd" }
{"_id"{"$oid":"5d38916b1c9d440000dcb68b"},"category_name":"Pasta","recipe_name":"Pasta Primavera","author_name":"BBC Good Food","prep_time_mins":"10","cook_time_prep":"20","complexity":"Easy","favourite":"False","servings":"4","brief_description":"A healthy spaghetti dish full of broad beans, leeks and asparagus tips. Make the most of spring greens with this vibrant, filling pasta recipe.","calories":"476","ingredients":["75g young broad beans, 2 x 100g pack asparagus tips, 170g peas, 350g spaghetti or tagliatelle, 175g pack baby leeks, 1 tbsp olive oil, 1 tbsp butter, 200ml tub fromage frais, handful fresh chopped herbs, parmesan cheese"],"instructions":["Bring a pan of salted water to the boil and put a steamer (or colander) over the water. Steam the beans, asparagus and peas until just tender, then set aside. Boil the pasta following pack instructions. Meanwhile, fry the leeks gently in the oil and butter for 5 mins or until soft. Add the fromage frais to the leeks and very gently warm through, stirring constantly to ensure it doesn’t split. Add the herbs and steamed vegetables with a splash of pasta water to loosen. Drain the pasta and stir into the sauce. Adjust the seasoning, then serve scattered with the cheese and drizzled with a little extra olive oil."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2017/05/healthy-pasta-primaver.jpg?itok=cDxf02S2" }
{"_id"{"$oid":"5d38940a1c9d440000dcb68c"},"category_name":"Pasta","recipe_name":"Prawn and Avocado Pasta Salad","author_name":"BBC Good Food","prep_time_mins":"10","cook_time_mins":"12","complexity":"Easy","favourite":"False","servings":"4","brief_description":"A tasty and superhealthy summer salad.","calories":"636","ingredients":["400g penne pasta, 400g raw peeled tiger prawns, 4 tbsp olive oil, 1 lemon, 1 small garlic clove, 1 large avocado, 250g cherry tomato, 2 spring onions, 100g bag rocket, small bunch basil leaves"],"instructions":["Cook the pasta in boiling water for 10-11 mins. Just before the end, add prawns and cook through. Drain, cool under cold water, drain and transfer to a big bowl. Put the oil, lemon juice and zest, garlic, avocado, tomatoes and spring onions in a separate bowl, then mix well – don’t mash the avocado. Season. Gently toss the mix into the pasta, with the rocket and basil."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--2389_12.jpg?itok=owsRGY8Y" }
{"_id"{"$oid":"5d409ae01c9d440000e16308"},"category_name":"Pasta","recipe_name":"Caponata Pasta","author_name":"Cassie Best","prep_time_mins":"2","cook_time_mins":"18","complexity":"Easy","favourite":"False","servings":"4","brief_description":"Whip up our easy vegetarian caponata pasta in just 20 minutes. It's simple to make and packs three of your 5-a-day into one delicious meal.","calories":"542","ingredients":["4 tbsp olive oil, 1 large onion, 4 garlic cloves, 250g chargrilled Mediterranean veg, 400g can chopped tomatoes, 1 tbsp small capers, 2 tbsp raisins, 350g rigatoni, bunch basil leaves, parmesan cheese"],"instructions":["Heat the oil in a large pan and cook the onion for 8-10 mins until starting to caramelise (or for longer if you have time – the sweeter the better). Add the garlic for the final 2 mins of cooking time. Tip in the mixed veg, tomatoes, capers and raisins. Season well and simmer, uncovered, for 10 mins, or until you have a rich sauce. Meanwhile, boil the kettle. Pour the kettleful of water into a large pan with a little salt and bring back to the boil. Add the pasta and cook until tender with a little bite, then drain, reserving some of the pasta water. Tip the pasta into the sauce, adding a splash of pasta water if it needs loosening. Scatter with the basil leaves and parmesan, if you like, and serve straight from the pan."],"recipe_image":"https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2019/02/caponata-pasta.jpg?itok=oyipDvVn" }

